[
  {"id": "king_1", "text": "Stephen King in On Writing stresses that to become a writer you must do two things above all: read a lot and write a lot. There is no shortcut. Read widely in and outside your genre. Write every day, even if only a little; treat it like a job.", "author": "Stephen King", "book_title": "On Writing", "chapter": "On Writing"},
  {"id": "king_2", "text": "King advises writing with the door closed: draft for yourself first, without thinking about the reader. Only when you revise do you open the door and consider what the reader needs. The first draft is the one you write for you.", "author": "Stephen King", "book_title": "On Writing", "chapter": "On Writing"},
  {"id": "king_3", "text": "In On Writing, King says the scariest moment is always just before you start. Once you begin, the fear often fades. So start before you feel ready. You can fix bad pages; you cannot fix a blank page.", "author": "Stephen King", "book_title": "On Writing", "chapter": "On Writing"},
  {"id": "king_4", "text": "King recommends cutting ruthlessly in revision. Kill your darlings: if a passage serves only to show off, cut it. Story and clarity come first. Adverbs are often weak; prefer a stronger verb.", "author": "Stephen King", "book_title": "On Writing", "chapter": "On Writing"},
  {"id": "king_5", "text": "Stephen King suggests writing to a target word count each day—for him, around two thousand words. Consistency matters more than inspiration. Sit down at the same time and place; make writing a habit.", "author": "Stephen King", "book_title": "On Writing", "chapter": "On Writing"},
  {"id": "lamott_1", "text": "Anne Lamott in Bird by Bird teaches the idea of 'bird by bird': when overwhelmed, focus on one small step. Your job is to write one scene, one paragraph, or one bird at a time. The rest will follow.", "author": "Anne Lamott", "book_title": "Bird by Bird", "chapter": "Bird by Bird"},
  {"id": "lamott_2", "text": "Lamott famously advises giving yourself permission to write a 'shitty first draft.' Nobody writes well on the first try. The first draft is for getting the story down; you make it good in revision.", "author": "Anne Lamott", "book_title": "Bird by Bird", "chapter": "Shitty First Drafts"},
  {"id": "lamott_3", "text": "In Bird by Bird, Lamott says that perfectionism is the voice of the oppressor. It will block you. Let yourself be messy and wrong in the draft. You can fix it later.", "author": "Anne Lamott", "book_title": "Bird by Bird", "chapter": "Perfectionism"},
  {"id": "lamott_4", "text": "Lamott encourages writing as discovery: you often don't know what you think until you write it. So show up, put words on the page, and let the process teach you. Writing is a way of seeing.", "author": "Anne Lamott", "book_title": "Bird by Bird", "chapter": "Getting Started"},
  {"id": "lamott_5", "text": "Anne Lamott suggests short assignments. Don't stare at the whole book; stare at a one-inch picture frame. Write what you can see through that frame. Small pieces add up.", "author": "Anne Lamott", "book_title": "Bird by Bird", "chapter": "Short Assignments"},
  {"id": "bradbury_1", "text": "Ray Bradbury in Zen in the Art of Writing urges writers to write with zest. If you are not excited, the reader will not be. Feed your creativity: read poetry, look at art, live with your eyes open.", "author": "Ray Bradbury", "book_title": "Zen in the Art of Writing", "chapter": "The Joy of Writing"},
  {"id": "bradbury_2", "text": "Bradbury advises making lists of nouns and images that fascinate you—the basement, the carnival, the autumn leaves. From these lists, stories grow. Your passions are your best material.", "author": "Ray Bradbury", "book_title": "Zen in the Art of Writing", "chapter": "Run Fast, Stand Still"},
  {"id": "bradbury_3", "text": "In Zen in the Art of Writing, Bradbury says to read poetry every day. Poetry teaches rhythm, compression, and the weight of a single word. It trains the ear and sharpens the eye.", "author": "Ray Bradbury", "book_title": "Zen in the Art of Writing", "chapter": "How to Keep and Feed a Muse"},
  {"id": "bradbury_4", "text": "Bradbury warns against writing for the market or for money first. Write what you love; write the story only you can write. Authenticity and enthusiasm show on the page.", "author": "Ray Bradbury", "book_title": "Zen in the Art of Writing", "chapter": "On the Shoulders of Giants"},
  {"id": "truby_1", "text": "John Truby in The Anatomy of Story teaches that every good story is built on a premise: a single line that captures the central conflict and its outcome. Before you write hundreds of pages, get the premise clear.", "author": "John Truby", "book_title": "The Anatomy of Story", "chapter": "Premise"},
  {"id": "truby_2", "text": "Truby argues that the best stories have a moral argument: the hero's flaw and need drive the plot. What does the character learn or fail to learn? The ending should test and reveal that.", "author": "John Truby", "book_title": "The Anatomy of Story", "chapter": "Moral Argument"},
  {"id": "truby_3", "text": "In The Anatomy of Story, Truby emphasizes the importance of the hero's ghost—the past wound that shapes their flaw. The ghost makes the character specific and gives the story emotional depth.", "author": "John Truby", "book_title": "The Anatomy of Story", "chapter": "Character"},
  {"id": "truby_4", "text": "Truby advises building the story from the inside out: theme and character first, then plot. Plot exists to put the character under pressure and force them to change or refuse to change.", "author": "John Truby", "book_title": "The Anatomy of Story", "chapter": "Plot"},
  {"id": "mckee_1", "text": "Robert McKee in Story teaches that structure is the selection of events and their arrangement in time. What happens, in what order, and why—that is structure. It creates meaning.", "author": "Robert McKee", "book_title": "Story", "chapter": "Structure"},
  {"id": "mckee_2", "text": "McKee defines the gap: the protagonist takes an action expecting one result, and the opposite or something else happens. That gap creates the next action. Story is the gap between expectation and result.", "author": "Robert McKee", "book_title": "Story", "chapter": "Structure and Meaning"},
  {"id": "mckee_3", "text": "In Story, McKee stresses that the protagonist must have a clear desire and face meaningful conflict. The more they want something and the harder it is to get, the more the audience cares.", "author": "Robert McKee", "book_title": "Story", "chapter": "Character"},
  {"id": "mckee_4", "text": "McKee warns against writing on the nose—dialogue or action that states exactly what the character feels. Use subtext: let the audience infer. What is unsaid often carries more weight.", "author": "Robert McKee", "book_title": "Story", "chapter": "Dialogue"},
  {"id": "mckee_5", "text": "Robert McKee says that the climax must be the true point of no return: the protagonist makes a choice or takes an action that resolves the central question. No deus ex machina; the character must earn it.", "author": "Robert McKee", "book_title": "Story", "chapter": "Crisis and Climax"},
  {"id": "method_1", "text": "Methodic writing means treating writing like a craft with repeatable habits. Set a daily word count or time. Write at the same time and place when possible. Track your progress.", "author": "Writing craft", "book_title": "Method and habit", "chapter": "Discipline"},
  {"id": "method_2", "text": "Professional writers separate drafting from editing. In the draft phase, keep moving forward. Do not go back to fix every sentence. In the revision phase, focus on structure, clarity, and style.", "author": "Writing craft", "book_title": "Method and habit", "chapter": "Draft and revise"},
  {"id": "method_3", "text": "Outline or plan before you write long works. Even a simple list of scenes or beats helps. You can deviate later, but having a map reduces the fear of the blank page and keeps the story on track.", "author": "Writing craft", "book_title": "Method and habit", "chapter": "Planning"},
  {"id": "method_4", "text": "Read like a writer: notice how other authors structure scenes, handle dialogue, and pace revelation. Take notes on what works. Your reading fuels your writing.", "author": "Writing craft", "book_title": "Method and habit", "chapter": "Reading"},
  {"id": "method_5", "text": "Finish what you start. Many writers have drawers full of half-finished projects. Completing a draft—even a bad one—teaches you more than endlessly polishing the opening.", "author": "Writing craft", "book_title": "Method and habit", "chapter": "Completion"},
  {"id": "dialogue_1", "text": "Good dialogue does more than convey information. It reveals character, advances the plot, and carries subtext. What the character does not say is often as important as what they say.", "author": "Writing craft", "book_title": "Dialogue", "chapter": "Subtext"},
  {"id": "dialogue_2", "text": "Give each character a distinct voice: vocabulary, rhythm, and topics. A teenager, a professor, and a soldier should not sound the same. Voice helps the reader tell who is speaking without constant tags.", "author": "Writing craft", "book_title": "Dialogue", "chapter": "Voice"},
  {"id": "revision_1", "text": "In revision, read the whole draft before changing anything. See the arc and the holes. Then revise in passes: first structure and pacing, then scenes, then line-by-line style and clarity.", "author": "Writing craft", "book_title": "Revision", "chapter": "Passes"},
  {"id": "revision_2", "text": "Cut anything that does not serve the story or the reader. If you love a sentence but it slows the pace or repeats an idea, cut it. Be ruthless in service of the whole.", "author": "Writing craft", "book_title": "Revision", "chapter": "Cutting"},
  {"id": "scene_1", "text": "A scene has a goal, conflict, and a turning point or disaster. The character enters wanting something; something blocks them or goes wrong; by the end something has changed. If nothing changes, the scene may be unnecessary.", "author": "Writing craft", "book_title": "Scene", "chapter": "Structure"},
  {"id": "scene_2", "text": "Show important moments in scene—with action and dialogue—and summarize the rest. Do not write every minute of the character's day. Summary compresses time; scene expands it. Use each where it fits.", "author": "Writing craft", "book_title": "Scene", "chapter": "Show and summarize"}
]
