[
  {
    "id": "nabokov_gift_1",
    "text": "Облако, как бы поддерживаемое снизу нежными подпорками света, застыло на нежно-голубом, с кое-где проступающим перламутром, небе; и, глядя на это небо, на эту, как бы недоконченную, акварель, Годунов-Чердынцев с наслаждением подумал о том, что вот сейчас он напишет стихи, — и это было то же самое чувство, как если бы он подумал о женщине, которая его ждет.",
    "category": "style",
    "author": "Владимир Набоков",
    "book_title": "Дар",
    "chapter": "Глава 1"
  },
  {
    "id": "nabokov_luzhin_1",
    "text": "Больше всего его поразило то, что с понедельника он будет Лужиным. Его отец — настоящий Лужин, пожилой Лужин, Лужин, писавший книги, — вышел от него, улыбаясь, потирая руки, уже смазанные на ночь прозрачным английским кремом, и своей вечерней замшевой походкой вернулся к себе в спальню.",
    "category": "style",
    "author": "Владимир Набоков",
    "book_title": "Защита Лужина",
    "chapter": "Глава 1"
  },
  {
    "id": "wallace_ij_1",
    "text": "Я сижу в кабинете, окруженный головами и телами. Моя поза сознательно конгруэнтна форме жесткого стула. Это холодная комната в Администрации Университета, обшитая деревом, Remmington-Hungerford, стены увешаны очень, очень смутно знакомыми мне выпускниками в высоких крахмальных воротничках, чьи взгляды устремлены в некое будущее, которое уже давно стало прошлым.",
    "category": "style",
    "author": "Дэвид Фостер Уоллес",
    "book_title": "Бесконечная шутка",
    "chapter": "Год Глэд"
  },
  {
    "id": "wallace_ij_2",
    "text": "Хэл Инканденца, восемнадцать лет, стоит в ожидании, пока его не спросят. Он знает, что его спросят. Он знает, что это неизбежно, как энтропия или налоги. Он чувствует, как в груди нарастает давление, похожее на то, когда пытаешься удержать под водой надувной мяч, только мяч — это он сам.",
    "category": "style",
    "author": "Дэвид Фостер Уоллес",
    "book_title": "Бесконечная шутка",
    "chapter": "Год Глэд"
  },
  {
    "id": "flaubert_bovary_1",
    "text": "Она хотела умереть, но она также хотела жить в Париже. Шарль в разговорах был плоским, как уличная панель, и мысли каждого проходили по ней в своей обычной одежде, не вызывая ни волнения, ни смеха, ни мечтаний. Он никогда не был любопытен, никогда не удивлялся.",
    "category": "style",
    "author": "Гюстав Флобер",
    "book_title": "Госпожа Бовари",
    "chapter": "Часть первая"
  },
  {
    "id": "flaubert_bovary_2",
    "text": "Слово — это всего лишь треснутый котел, по которому мы выстукиваем мелодии для медведей, когда нам хотелось бы растрогать звезды. Никто никогда не может дать точную меру своих потребностей, ни своих понятий, ни своих скорбей.",
    "category": "style",
    "author": "Гюстав Флобер",
    "book_title": "Госпожа Бовари",
    "chapter": "Часть вторая"
  },
  {
    "id": "proust_swann_1",
    "text": "Долгое время я ложился спать рано. Иногда, едва только свеча была потушена, глаза мои закрывались так быстро, что я не успевал сказать себе: «Я засыпаю». И полчаса спустя мысль, что мне пора спать, будила меня; я хотел отложить книгу, которую, как мне казалось, я все еще держал в руках, и погасить свет; во сне я не переставал думать о прочитанном, но мысли мои принимали несколько странный оборот.",
    "category": "style",
    "author": "Марсель Пруст",
    "book_title": "В сторону Свана",
    "chapter": "Комбре"
  },
  {
    "id": "proust_swann_2",
    "text": "Но как только я узнал вкус размоченного в липовом чае кусочка мадлен, который дала мне тетя (хотя я еще не знал и должен был гораздо позже открыть, почему это воспоминание делало меня таким счастливым), тотчас же старый серый дом на улице, куда выходили окна ее комнаты, придвинулся, как декорация, к маленькому флигелю, выходившему в сад.",
    "category": "style",
    "author": "Марсель Пруст",
    "book_title": "В сторону Свана",
    "chapter": "Комбре"
  }
]